
title=&#12450;&#12503;&#12524;&#12483;&#12488;

tab1=&#12466;&#12540;&#12512;&#12474;
tab2=&#12497;&#12474;&#12523;
tab3=&#12471;&#12511;&#12517;&#12524;&#12540;&#12471;&#12519;&#12531;

introduction=&nbsp;&nbsp;&nbsp;&#12356;&#12367;&#12388;&#12363;&#31169;&#12364;&#38283;&#30330;&#12375;&#12383;Java&#12503;&#12525;&#12464;&#12521;&#12512;&#12434;&#12503;&#12524;&#12452;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12371;&#12398;&#12506;&#12540;&#12472;&#12363;&#12425;. \
The japanese translations found in these localizeed applets were done by Bill Keese.\
<a href="applet_index_en.html">&#33521;&#35486;</a>, \
<a href="applet_index_de.html">&#12489;&#12452;&#12484;&#35486;</a>, \
<a href="applet_index_vi.html">&#12505;&#12488;&#12490;&#12512;&#12398;</a>, \
<a href="applet_index_jp.html">&#26085;&#26412;&#20154;</a>.

appletGameEntries= {penteTR}  {checkersTR}  {chessTR}  {goTR}  {blockadeTR}
appletPuzzleEntries={redpuzzleTR} {sudokuTR}
appletSimulationEntries={snakeTR}  {diceTR}

language=JAPANESE
locale=ja

pente.title=&#36899;&#29664;
pente.description=&#34892;&#12395;&#12399;&#12289;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12399;&#21069;&#12395;5&#12434;&#21462;&#24471;&#12375;&#12390;&#21213;&#21033;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
pente.longDescription=&#34892;&#12395;&#12399;&#12289;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12399;&#21069;&#12395;5&#12434;&#21462;&#24471;&#12375;&#12390;&#21213;&#21033;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; \
  &#31169;&#12399;&#12503;&#12524;&#12540;&#12395;&#31169;&#12398;&#22971;&#12392;&#12398;&#12392;&#12365;&#12395;&#26368;&#21021;&#12395;&#20250;&#12387;&#12383;&#22810;&#12367;&#12398;&#36899;&#29664;&#20351;&#29992;&#12373;&#12428;&#12427;&#65288;&#24444;&#22899;&#12399;&#12363;&#12394;&#12426;&#12381;&#12428;&#12391;&#33391;&#12356;&#12391;&#12375;&#12423;&#12358;&#65289;&#12290;&#36899;&#29664;&#31169;&#12399;&#33258;&#20998;&#12398;&#12466;&#12540;&#12512;&#12398;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12434;&#20351;&#29992;&#12375;&#12390;&#20316;&#25104;&#12375;&#12383;&#26368;&#21021;&#12398;&#12466;&#12540;&#12512;&#12391;&#12377;&#12290;&#31169;&#12364;&#26368;&#21021;&#12395;&#25147;&#12427;1991&#24180;&#12395;&#12289;&#12371;&#12428;&#12399;1&#12388;&#12398;&#20778;&#12428;&#12390;&#12356;&#12427;Pascal&#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#20316;&#25104;&#12375;&#12414;&#12375;&#12383;&#12290;&#12466;&#12540;&#12512;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;&#34892;&#65288;&#27700;&#24179;&#12289;&#22402;&#30452;&#12289;&#12414;&#12383;&#12399;&#26012;&#12417;&#12395;5&#65289;&#12434;&#21462;&#24471;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;&#12377;&#12409;&#12390;&#12398;&#12466;&#12540;&#12512;&#12392;&#21516;&#27096;&#12395;&#12289;&#12371;&#12398;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12434;&#20351;&#29992;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12289;&#21029;&#12398;&#20154;&#12289;&#12414;&#12383;&#12399;&#12381;&#12428;&#33258;&#20307;&#12395;&#23550;&#12375;&#12390;&#12399;&#12289;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12466;&#12540;&#12512;&#12364;&#23550;&#25126;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12434;&#20316;&#25104;&#12375;&#12414;&#12375;&#12383;&#12290;

checkers.title=&#12481;&#12455;&#12483;&#12459;&#12540;
checkers.description=&#12377;&#12409;&#12390;&#12398;&#24444;&#22899;&#12398;&#20316;&#21697;&#12434;&#12461;&#12515;&#12503;&#12481;&#12515;&#12375;&#12390;&#12289;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12398;&#12499;&#12540;&#12488;&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12354;&#12394;&#12383;&#12398;&#20316;&#21697;&#12398;&#19978;&#37096;&#12395;&#12354;&#12426;&#12414;&#12377;&#12290;&#12489;&#12521;&#12483;&#12464;&#12450;&#12531;&#12489;&#12489;&#12525;&#12483;&#12503;&#12434;&#20351;&#29992;&#12375;&#12390;&#31227;&#21205;&#12375;&#12414;&#12377;&#12290;
checkers.longDescription=&#12481;&#12455;&#12483;&#12459;&#12540;&#12399;&#12289;&#21336;&#32020;&#12394;&#12466;&#12540;&#12512;&#12391;&#12377;&#12290;&#24460;&#12289;&#31169;&#12399;&#12289;&#36899;&#29664;&#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#12434;&#23455;&#34892;&#12375;&#12390;&#24471;&#12383;&#26082;&#12395;&#36861;&#21152;&#12466;&#12540;&#12512;&#12434;&#20316;&#25104;&#12377;&#12427;&#12383;&#12417;&#12398;&#26528;&#32068;&#12415;&#12392;&#12375;&#12390;&#12289;&#31169;&#12399;&#12431;&#12378;&#12363;2&#36913;&#26411;&#12395;&#12381;&#12428;&#12434;&#23455;&#35013;&#12290;&#12377;&#12409;&#12390;&#12398;&#30456;&#25163;&#20316;&#21697;&#12398;&#25774;&#24433;&#12434;&#29554;&#24471;&#12375;&#12383;&#12290;

chess.title=&#12481;&#12455;&#12473;
chess.description=&#24444;&#22899;&#12398;&#29579;&#12481;&#12455;&#12483;&#12463;&#12513;&#12452;&#12488;&#12375;&#12390;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12434;&#12499;&#12540;&#12488;&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12354;&#12394;&#12383;&#12398;&#20316;&#21697;&#12398;&#19978;&#37096;&#12395;&#12354;&#12426;&#12414;&#12377;&#12290;&#12489;&#12521;&#12483;&#12464;&#12450;&#12531;&#12489;&#12489;&#12525;&#12483;&#12503;&#12434;&#20351;&#29992;&#12375;&#12390;&#31227;&#21205;&#12375;&#12414;&#12377;&#12290;
chess.longDescription=&#12481;&#12455;&#12473;&#12399;&#12289;&#27604;&#36611;&#30340;&#31777;&#21336;&#12394;&#12466;&#12540;&#12512;&#12434;&#34892;&#12387;&#12390;&#27604;&#36611;&#12373;&#12428;&#12414;&#12377;&#12290;&#31169;&#12399;3&#26085;&#38291;&#12391;&#12371;&#12428;&#12434;&#23455;&#35013; - &#24460;&#12289;&#31169;&#12399;1&#24180;&#12392;&#31169;&#12398;&#12472;&#12515;&#12527;&#12398;&#12466;&#12540;&#12512;&#12398;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12398;&#27531;&#12426;&#12398;&#37096;&#20998;&#12408;&#12398;&#23455;&#35013;&#12434;&#36942;&#12372;&#12375;&#12383;&#12290;&#12481;&#12455;&#12483;&#12463;&#12513;&#12452;&#12488;&#30456;&#25163;&#12398;&#29579;&#12434;&#29554;&#24471;&#12375;&#12383;&#12290;

go.title=&#22258;&#30849;
go.description=&#20197;&#19978;&#12398;&#38936;&#22495;&#12434;&#12461;&#12515;&#12503;&#12481;&#12515;&#12375;&#12390;&#12289;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12398;&#12499;&#12540;&#12488;&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12392;&#12365;&#12395;&#30707;&#12398;&#12464;&#12523;&#12540;&#12503;&#12395;&#23436;&#20840;&#12395;&#22258;&#12414;&#12428;&#12390;&#12289;&#24444;&#12425;&#12399;&#22522;&#26495;&#12363;&#12425;&#12392;&#12394;&#12426;&#12289;&#12461;&#12515;&#12503;&#12481;&#12515;&#12364;&#21066;&#38500;&#12373;&#12428;&#12414;&#12377;&#12290;
go.longDescription=&#22810;&#12367;&#12398;&#20154;&#12293;&#12395;&#12418;&#12289;&#20013;&#38291;&#12398;&#36984;&#25163;&#12395;&#21213;&#12390;&#12427;&#12363;&#12418;&#30693;&#12428;&#12394;&#12356;&#12503;&#12525;&#12464;&#12521;&#12512;&#12434;&#34892;&#12367;&#12424;&#12358;&#12395;&#12375;&#12424;&#12358;&#12392;&#12375;&#12390;&#12356;&#12427;&#12290;&#12371;&#12428;&#12414;&#12391;&#12398;&#12392;&#12371;&#12429;&#12393;&#12428;&#12418;&#25104;&#21151;&#12375;&#12390;&#12356;&#12427;&#12290;&#12381;&#12371;&#12391;&#12418;&#35504;&#12391;&#12418;&#12381;&#12428;&#12434;&#34892;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#19975;&#12489;&#12523;&#12398;&#22577;&#37228;&#12391;&#12377;&#12290;&#31169;&#12399;&#12393;&#12385;&#12425;&#12363;&#12364;&#12289;&#26399;&#24453;&#12375;&#12390;&#12356;&#12394;&#12356;&#31169;&#12398;&#21205;&#27231;&#12399;&#12289;&#12486;&#12473;&#12488;&#12505;&#12483;&#12489;&#30064;&#12394;&#12427;&#12450;&#12503;&#12525;&#12540;&#12481;&#12434;&#12375;&#12424;&#12358;&#12392;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;&#12381;&#12398;&#12466;&#12540;&#12512;&#12398;&#30446;&#30340;&#12399;&#12289;&#12391;&#12365;&#12427;&#12384;&#12369;&#22810;&#12367;&#12398;&#38936;&#22303;&#12434;&#24471;&#12427;&#12371;&#12392;&#12391;&#12354;&#12427;&#12290;&#12371;&#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#12399;&#12289;&#12414;&#12384;&#27491;&#30906;&#12394;&#24471;&#28857;&#12392;&#12356;&#12367;&#12388;&#12363;&#12398;&#21839;&#38988;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;

blockade.title=&#23553;&#37782;
blockade.description=&#24444;&#22899;&#12398;&#12507;&#12540;&#12512;&#12505;&#12540;&#12473;&#12289;&#26368;&#21021;&#12395;&#21040;&#36948;&#12375;&#12390;&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12434;&#12499;&#12540;&#12488;&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12354;&#12394;&#12383;&#12398;&#22721;&#12434;&#37197;&#32622;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#21508;&#37096;&#20998;&#12398;&#21205;&#12365;&#12398;&#24460;&#12290;&#26178;&#12398;&#22721;&#12434;&#37197;&#32622;&#12377;&#12427;&#12289;&#12383;&#12384;&#12375;&#12289;&#23436;&#20840;&#12395;&#20219;&#24847;&#12398;&#30456;&#25163;&#12398;&#12507;&#12540;&#12512;&#12505;&#12540;&#12473;&#12395;&#21040;&#36948;&#12377;&#12427;&#12377;&#12409;&#12390;&#12398;&#37096;&#20998;&#12434;&#20999;&#26029;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
blockade.longDescription=&#23553;&#37782;&#12399;&#27604;&#36611;&#30340;&#26032;&#12375;&#12356;&#12466;&#12540;&#12512;\
  &#12398;&#28246;&#30036;&#12391;&#20316;&#25104;&#12373;&#12428;&#12414;&#12377;&#12290;&#31169;&#12399;&#23376;&#20379;&#12398;\
  &#12424;&#12358;&#12395;&#12503;&#12524;&#12452;&#12375;&#12390;&#12356;&#12383;&#12364;&#12289;&#31169;&#12398;&#24215;&#12391;&#12418;\
  &#12358;&#12371;&#12428;&#20197;&#19978;&#12399;&#34920;&#31034;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#21508;&#36984;&#25163;\
  &#12399;&#12289;&#21462;&#32224;&#24441;&#20250;&#12398;&#24444;&#12425;&#12398;&#20596;&#36817;&#12367;&#12395;&#25351;&#23450;&#12373;&#12428;\
  &#12383;&#31354;&#38291;&#19978;&#12398;2&#12388;&#12398;&#12509;&#12540;&#12531;&#12391;&#22987;&#12414;&#12426;&#12414;&#12377;&#12290;&#12371;\
  &#12428;&#12425;&#12398;&#12381;&#12428;&#12382;&#12428;&#12399;&#12289;&#12464;&#12522;&#12483;&#12489;&#12398;&#27491;&#26041;&#24418;&#12391;&#12354;\
  &#12426;&#12289;2&#12388;&#12398;&#27491;&#26041;&#24418;&#20840;&#20307;&#12392;&#12398;&#38291;&#12398;&#12473;&#12525;&#12483;&#12488;&#12395;&#21454;\
  &#12414;&#12427;10&#32209;&#12398;&#22721;&#12289;&#65288;&#36890;&#24120;&#12399;&#65289;10&#38738;&#33394;&#12398;&#22721;&#12364;&#12354;&#12426;&#12414;\
  &#12377;&#12290;&#12503;&#12524;&#12452;&#12516;&#12540;&#12398;&#12479;&#12540;&#12531;&#12399;&#12289;&#12464;&#12522;&#12483;&#12489;&#19978;&#12398;&#12393;\
  &#12371;&#12398;&#22721;&#12434;&#37197;&#32622;&#12377;&#12427;&#24444;&#12398;&#12509;&#12540;&#12531;2&#12388;&#12398;&#12473;&#12506;&#12540;&#12473;&#12392;\
  &#12375;&#12390;&#12398;&#31227;&#21205;&#12391;&#27083;&#25104;&#12373;&#12428;&#12414;&#12377;&#12290;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;\
  &#12289;&#30456;&#25163;&#12395;&#12424;&#12387;&#12390;&#35373;&#23450;&#12373;&#12428;&#12427;&#12392;1&#12388;&#12398;&#24444;&#12414;&#12383;&#12399;&#24444;&\
  #22899;&#12398;&#20986;&#30330;&#12398;&#12473;&#12506;&#12540;&#12473;&#12395;1&#12388;&#12398;&#38556;&#23475;&#29289;&#12398;&#21608;&#12426;&#12395;&#39378;\
  &#12434;&#21462;&#24471;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;&#12381;&#12428;&#12363;&#12425;&#23436;&#20840;&#12395;&#12509;&#12540;&#12531;\
  &#12434;&#12502;&#12525;&#12483;&#12463;&#12377;&#12427;&#12398;&#12356;&#12378;&#12428;&#12363;&#12398;&#30446;&#27161;&#12434;&#36948;&#25104;&#12391;&#12365;\
  &#12427;&#12371;&#12392;&#12399;&#36949;&#27861;&#12391;&#12377;&#12290;

redpuzzle.title=&#36196;&#12497;&#12474;&#12523;
redpuzzle.description=&#12467;&#12531;&#12500;&#12517;&#12540;&#12479;&#12398;&#21161;&#12369;&#12434;&#20511;\
  &#12426;&#12378;&#12395;&#34892;&#12358;&#12371;&#12392;&#12399;&#12411;&#12412;&#19981;&#21487;&#33021;&#12391;&#12377;\
  9&#12500;&#12540;&#12473;&#12398;&#12472;&#12464;&#12477;&#12540;&#12497;&#12474;&#12523;&#12290;
redpuzzle.longDescription=&#36196;&#12497;&#12474;&#12523;&#65288;&#12414;&#12383;&#12464;&#12524;&#12540;&#12488;&#12450;\
  &#12513;&#12522;&#12459;&#12531;&#12497;&#12474;&#12523;&#12363;&#12425;"One&#12479;&#12501;&#12497;&#12474;\
  &#12523;"&#12392;&#21628;&#12400;\
&#12501;&#12449;&#12463;&#12488;&#12522;&#12540;&#26666;&#24335;&#20250;&#31038;&#65289;&#12399;9&#12500;&#12540;\
  &#12473;&#12398;&#12472;&#12464;&#12477;&#12540;&#12497;&#12474;&#12523;&#12391;&#12377;&#12290;&#12381;&#12428;&#12399;\
  &#38750;&#24120;&#12395;&#22256;&#38627;&#12391;&#12354;&#12427;&#12383;&#12417;&#12289;&#12377;&#12409;&#12390;&#12398;\
&#20316;&#21697;&#12395;&#12399;&#12289;4&#12388;&#12398;&#12371;&#12406;&#12434;&#25345;&#12387;&#12390;&#12356;\
  &#12414;&#12377;&#12290;&#20840;&#12367;&#12456;&#12483;&#12472;&#37096;&#20998;&#12364;&#12354;&#12426;&#12414;\
  &#12379;&#12435;&#12290; 30&#19975;&#38291;&#36949;&#12387;&#20197;&#19978;&#12354;&#12426;&#12414;&#12377;\
&#27083;&#25104;&#12290; \
60,000&#22238;&#12398;&#21453;&#24489; - &#12502;&#12523;&#12540;&#12488;&#12501;&#12457;&#12540;&#12473;&#12477;\
  &#12523;&#12496;&#12399;&#32004;5,000&#12391;&#12381;&#12428;&#12434;&#35299;&#27770;&#12375;&#12414;&#12377;\
  &#12354;&#12387;&#12383;&#12425;&#12290; \
&#21029;&#12398;&#32080;&#26524;&#12399;&#12289;&#21508;&#26178;&#38291;&#12364;&#12354;&#12427;&#12398;&#12391;\
  &#12289;&#12381;&#12428;&#12399;&#37096;&#20998;&#12434;&#20999;&#12426;&#30452;&#12377;&#12290;&#26908;&#32034;\
&#12381;&#12428;&#12364;&#21512;&#12431;&#12394;&#12356;&#26041;&#12434;&#35211;&#12388;&#12369;&#12427;&#12414;\
  &#12391;&#12398;&#12450;&#12523;&#12468;&#12522;&#12474;&#12512;&#12399;&#12500;&#12540;&#12473;&#12434;&#12375;\
  &#12424;&#12358;&#12392;&#12375;&#12414;&#12377;&#12290;&#12418;&#12375;\
  &#12398;&#12393;&#12428;&#12418;\
&#12377;&#12409;&#12390;&#12398;&#22238;&#36578;&#12364;&#35430;&#12373;&#12428;&#12390;&#12365;&#12383;&#24460;&#12395;\
  &#27531;&#12387;&#12383;&#37096;&#20998;&#12364;&#12501;&#12451;&#12483;&#12488;&#12289;&#12381;&#12428;&#12364;&#12496;\
  &#12483;&#12463;&#12488;&#12521;&#12483;&#12463;\
1&#20301;&#32622;&#12399;&#12289;&#20877;&#24230;&#35430;&#34892;&#12375;&#12414;&#12377;&#12290;&#12381;&#12398;&#22580;\
  &#21512;&#12381;&#12371;&#12395;&#35299;&#27770;&#31574;&#12434;&#35211;&#12388;&#12369;&#12427;&#12371;&#12392;\
  &#12364;&#20445;&#35388;\
&#19968;&#12388;&#12391;&#12377;&#12290; \
&#12502;&#12523;&#12540;&#12488;&#12501;&#12457;&#12540;&#12473;&#12364;&#12381;&#12358;&#20006;&#34892;&#24615;&#12392;\
  &#12434;&#20351;&#29992;&#12377;&#12427;&#20182;&#12398;&#12477;&#12523;&#12496;&#12540;&#12434;&#20316;&#25104;\
  &#12375;&#12289;&#36933;&#12377;&#12366;&#12354;&#12387;&#12383;&#12425;\
&#12399;&#12427;&#12363;&#12395;&#39640;&#36895;/\&#35299;&#27770;&#31574;&#12434;&#35211;&#12388;&#12369;&#12427;\
  &#12424;&#12358;&#12395;&#12377;&#12427;&#36986;&#20253;algorthm&#26908;&#32034;\
&#25991;&#23383;&#12364;&#12371;&#12406;&#12398;&#24418;&#29366;&#12434;&#25351;&#31034;&#12354;&#12387;&#12383;\
&#12425;&#65306;&#12495;&#12540;&#12488;&#12289;&#12480;&#12452;&#12516;&#12514;&#12531;&#12489;&#12289;&#12463;&#12521;&#12502;\
&#12414;&#12383;&#12399;&#12473;&#12506;&#12540;&#12489;&#12290;&#24444;&#12425;&#12364;&#26412;&#24403;&#12395;&#35211;\
  &#12360;&#12427;&#12424;&#12358;&#12395;&#12356;&#12388;&#12363;&#31169;&#12399;&#20316;&#21697;&#12434;&#25551;\
  &#12365;&#12414;&#12377;&#12290;

sudoku.title=&#25968;&#29420;&#12497;&#12474;&#12523;
sudoku.description=&#25968;&#29420;&#12497;&#12474;&#12523;&#12398;&#12472;&#12455;&#12493;&#12524;&#12540;&#12479;\
  &#12392;&#12477;&#12523;&#12496;&#12540;&#12290;
sudoku.longDescription=<a href="http://en.wikipedia.org/wiki/Sudoku">&#25968;&#29420;</a>&#12434;\
&#26368;&#26032;&#12398;&#12497;&#12474;&#12523;&#12502;&#12540;&#12512;&#12391;&#12377;&#12290;&#31169;&#12399;&#12289;\
 &#25163;&#12391;&#12381;&#12428;&#12425;&#12434;&#35299;&#27770;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#12377;\
  &#12409;&#12390;&#12398;&#33391;&#12356;&#12371;&#12392;&#12399;&#12394;&#12356;&#12424;\
&#12398;&#12391;&#12289;&#31169;&#12399;&#12381;&#12428;&#12434;&#34892;&#12358;&#12383;&#12417;&#12398;&#12503;&#12525;\
  &#12464;&#12521;&#12512;&#12434;&#26360;&#12356;&#12383;&#12290;&#27597;&#12392;&#31169;&#12399;&#19968;&#32210;&#12395;\
  &#12487;&#12470;&#12452;&#12531;&#12434;&#20316;&#25104;&#12375;&#12414;&#12375;&#12383;&#12290; \
&#24444;&#22899;&#12399;&#12505;&#12523;&#30740;&#31350;&#25152;&#12391;&#12503;&#12525;&#12464;&#12521;&#12510;&#12540;\
  &#12391;&#12354;&#12427;&#12371;&#12392;&#12364;&#20351;&#29992;&#12373;&#12428;&#12289;&#12363;&#12394;&#12426;&#12398;\
  &#25968;&#29420;&#26524;&#12383;&#12375;&#12390;&#12356;&#12427;&#12290; \
&#35299;&#27770;&#12377;&#12427;&#12383;&#12417;&#12398;&#19968;&#33324;&#30340;&#12394;&#12450;&#12503;&#12525;&#12540;\
  &#12481;&#12399;&#12289;&#21508;&#34892;&#12289;&#21015;&#12289;&#12362;&#12424;&#12403;&#22823;&#32048;&#32990;&#12391;\
  &#32048;&#32990;&#12434;&#32771;&#24942;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;\
&#20505;&#35036;&#32773;&#12398;&#20132;&#24046;&#28857;&#12399;&#12289;&#12371;&#12428;&#12425;&#12398;&#12381;&#12428;\
  &#12382;&#12428;&#12364;1&#30058;&#21495;&#12391;&#12354;&#12427;&#12383;&#12417;&#12395;&#12522;&#12473;&#12488;&#12373;\
  &#12428;&#12390;&#12356;&#12427;&#12363;&#12393;&#12358;&#12363;&#12289;&#12381;&#12398;&#24460;&#12434;&#21442;&#29031;\
  &#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; \
&#12381;&#12398;&#22580;&#21512;&#12399;&#12289;&#12377;&#12409;&#12390;&#12398;&#12475;&#12523;&#12395;&#23550;&#12375;\
  &#12390;&#12289;&#32368;&#12426;&#36820;&#12377;&#12371;&#12392;&#12434;&#12420;&#12387;&#12383;&#12392;&#12365;&#12289;\
  &#12381;&#12428;&#12434;&#35352;&#20837;&#12290;&#12381;&#12428;&#12399;&#12289;&#36890;&#24120;&#12289;&#12363;\
  #12363;&#12427;&#12384;&#12369;\
&#25968;&#22238;&#12398;&#21453;&#24489;&#12399;&#12289;&#35299;&#27770;&#31574;&#12434;&#35211;&#12388;&#12369;\
  &#12427;&#12383;&#12417;&#12395;&#12290;&#31169;&#12383;&#12385;&#12399;&#22522;&#26412;&#30340;&#12395;&#12394;\
  &#12356;&#12383;&#12417;&#19990;&#20195;&#12399;&#12289;&#26178;&#38291;&#12364;&#12363;&#12363;&#12426;&#12414;&#12377;\
&#35299;&#27770;&#12508;&#12540;&#12489;&#12391;&#22987;&#12414;&#12426;&#12289;&#12521;&#12531;&#12480;&#12512;\
  &#12395;&#31169;&#12383;&#12385;&#12364;&#12391;&#12365;&#12427;&#12377;&#12409;&#12390;&#12398;&#30058;&#21495;\
  &#12434;&#21066;&#38500;&#12375;&#12390;&#12418;&#35299;&#27770;&#31574;&#12434;&#25512;&#28204;&#12290; \
&#12371;&#12428;&#12399;&#12289;&#25105;&#12293;&#12399;&#12508;&#12540;&#12489;&#20840;&#20307;&#31169;&#12383;\
  &#12385;&#12399;&#30058;&#21495;&#12434;&#21066;&#38500;&#12377;&#12427;&#12383;&#12403;&#12395;&#35299;&#27770;\
  &#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12371;&#12392;&#12434;&#24847;&#21619;\
  &#12375;&#12414;&#12377;&#12290;

snake.title=&#12504;&#12499;
snake.description=&#26412;&#29289;&#12398;&#12504;&#12499;&#12398;&#21205;&#12365;&#12434;&#12471;&#12511;&#12517;&#12524;\
  &#12540;&#12488;&#12375;&#12414;&#12377;&#12290;&#12462;&#12515;&#12499;&#12531;&#183;&#12511;&#12521;&#12540;1988 SIGGRAPH&#12398;&#35542;&#25991;&#12395;&#22522;&#12389;&#12367;&#12290;\
&#12462;&#12515;&#12499;&#12531;&#183;&#12511;&#12521;&#12540;&#12290;&#12354;&#12394;&#12383;&#12399;&#12289;&#34503;&#12364;&#31227;\
  &#21205;&#12377;&#12427;&#26041;&#27861;&#12395;&#24433;&#38911;&#12434;&#19982;&#12360;&#12427;&#12497;&#12521;&#12513;&#12540;&#12479;\
  &#12434;&#35519;&#25972;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12481;&#12455;&#12483;&#12463;&#12434;\
  &#22806;&#12375;&#12390;&#19968;&#26178;&#20572;&#27490;&#12399;&#12289;&#12450;&#12491;&#12513;&#12540;&#12471;&#12519;&#12531;&#12434;&#38283;&#22987;&#12375;&#12414;&#12377;&#12290;
snake.longDescription=&#12514;&#12487;&#12523;&#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;\
&#31563;&#32905;&#12398;&#21454;&#32302;&#12434;&#8203;&#8203;&#12471;&#12511;&#12517;&#12524;&#12540;&#12488;&#12377;&#12427;\
  &#12383;&#12417;&#12395;&#21508;&#20596;&#12395;&#21360;&#21152;&#12373;&#12428;&#12427;&#27491;&#24358;&#27874;&#21147;&#27231;\
  &#33021;&#12364;&#12354;&#12427;&#12290; \
&#25351;&#21521;&#25705;&#25830;&#12364;&#34503;&#12364;&#65288;&#26412;&#24403;&#12398;&#12504;&#12499;&#12391;&#30330;&#29983;&#65289;\
  &#21069;&#36914;&#12377;&#12427;&#12383;&#12417;&#12395;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290; \
&#12289;sindwinding&#12289;&#30452;&#32218;&#30340;&#12394;&#36914;&#34892;&#12289;&#27700;&#24179;&#27874;&#21205;&#12398;&#36914;&#34892;\
  &#65306;&#12504;&#12499;&#12289;&#31227;&#21205;&#12398;4&#12388;&#12398;&#26041;&#27861;&#12434;&#25345;&#12387;&#12390;&#12356;&#12427;\
&#12381;&#12375;&#12390;&#12467;&#12531;&#12469;&#12398;&#36914;&#34892;&#65288;&#12417;&#12387;&#12383;&#12395;&#20351;&#12431;&#12428;\
&#12394;&#12356;&#65289;&#12290;&#31169;&#12399;&#12289;&#26368;&#12418;&#19968;&#33324;&#30340;&#12394;&#27497;&#34892;&#12289;&#27700;\
&#24179;&#27874;&#21205;&#12398;&#36914;&#34892;&#12289;\
&#12434;&#20351;&#29992;&#12371;&#12398;&#12487;&#12514;&#12391;&#12399;&#12289;&#12362;&#12381;&#12425;&#12367;&#20182;\
  &#12398;&#20154;&#12364;&#36861;&#21152;&#12373;&#12428;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;\
  &#12434;&#22793;\
  &#26356;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;\
&#12371;&#12398;&#27497;&#34892;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12364;&#30064;&#12394;&#12427;&#21205;&#20316;\
  &#12434;&#21462;&#24471;&#12375;&#12414;&#12377;&#12290; \
&#12504;&#12499;&#12399;&#12289;&#33258;&#21205;&#21270;&#12373;&#12428;&#12383;&#26368;&#36969;&#21270;&#12398;&#12503;&#12525;&#12475;&#12473;\
  &#12395;&#12424;&#12387;&#12390;&#12289;&#12424;&#12426;&#21177;&#29575;&#30340;&#12395;&#31227;&#21205;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289; "&#23398;&#32722;"&#12290; \
&#12371;&#12428;&#12399;&#12289;&#31169;&#12399;&#12289;&#12466;&#12540;&#12512;&#12503;&#12525;&#12464;&#12521;&#12512;&#12398;&#12497;&#12501;&#12457;&#12540;\
  &#12510;&#12531;&#12473;&#12434;&#21521;&#19978;&#12373;&#12379;&#12427;&#12383;&#12417;&#12395;&#20351;&#29992;&#27491;&#30906;&#12395;&#26368;&#36969;&#21270;\
  &#12467;&#12540;&#12489;&#12434;&#20351;&#29992;&#12377;&#12427;&#12290; \
&#31169;&#12399;&#20170;&#12289;&#26412;&#24403;&#12395;&#12424;&#12367;&#26041;&#27861;&#12504;&#12499;&#12398;&#21205;&#12365;&#12434;&#29702;&#35299;&#12375;\
  #12390;&#12356;&#12414;&#12377;&#12290; \
&#12418;&#12375;href="http://www.snakerobots.com/simulation.html">&#12462;&#12515;&#12499;&#12531;&#183;&#12511;&#12521;&#12540;\
  &#12395;&#12424;&#12427;&#20316;&#26989;&#12395;&#22522;&#12389;&#12356;&#12390;</a>&#24444;&#12398;1988 SIGGRAPH&#12398;&#35542;&#25991;&#12391;&#12354;&#12427;&#12290;

dice.title=&#12469;&#12452;&#12467;&#12525;
dice.description=M&#36794;&#12392;N&#20491;&#12398;&#12469;&#12452;&#12467;&#12525;&#12434;&#36578;&#12364;&#12377;&#12471;&#12511;&#12517;&#12524;&#12540;&#12488;&#12375;&#12414;&#12377;&#12290;
dice.longDescription=&#31169;&#12399;&#24687;&#23376;&#12392;&#24444;clasmates&#12395;&#30906;&#29575;&#20998;&#24067;&#12434;&#35500;&#26126;&#12377;&#12427;&#12383;&#12417;&#12398;&#33391;&#12356;&#26041;&#27861;&#12434;&#25506;&#12375;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;\
&#12371;&#12398;&#21336;&#32020;&#12394;&#12503;&#12525;&#12464;&#12521;&#12512;&#12391;&#12399;&#12289;&#12505;&#12523;&#26354;&#32218;&#12398;&#30064;&#12394;&#12427;&#31278;&#39006;&#12434;&#31034;&#12375;&#12390;&#12356;&#12414;&#12377;